# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти
# плоскости, в которой находится эта точка (или на какой оси она находится).

#Пример:

#- x=34; y=-30 -> 4
#- x=2; y=4-> 1
#- x=-34; y=-30 -> 3

x_coo = int(input("Введите координату X = "))
y_coo = int(input("Введите координату Y = "))

def quart(x, y):
    if x == 0 and y == 0:
        print ("Вы ввели некорректные коодинаты")
    else:
        if x == 0 and y != 0:
            print("Точка лежит на оси Y")  
        elif x != 0 and y == 0:
            print("Точка лежит на оси X")        
        elif x > 0 and y > 0:
            print(" -> 1")
        elif x < 0 and y > 0:
            print(" -> 2") 
        elif x < 0 and y < 0:
            print(" -> 3")
        else:
            print(" -> 4")

quart(x_coo,y_coo)